import time

print(time.time())

#время.время()
#время.время()
#время.время()

#время.время()
class Робот:
    def __init__(self, имя, модель):
        self.имя = имя
        self.модель = модель
        self.энергия = 100
        self.инвентарь = []

    def статус(self):
        print("--- ОТЧЕТ СИСТЕМЫ ---")
        print("Имя: " + self.имя)
        print("Заряд: " + str(self.энергия) + "%")
        print("Предметы: " + str(self.инвентарь))

    def взять_вещь(self, предмет):
        self.инвентарь.append(предмет)
        print(self.имя + " положил в сумку: " + предмет)

    def работа(self, задача):
        if self.энергия > 20:
            print("Выполняю: " + задача)
            self.энергия = self.энергия - 30
        else:
            print("НИЗКИЙ ЗАРЯД! Работа невозможна.")

def расчет_мощности(а, б):
    return а * б

print(" === ЗАПУСК ПРОГРАММЫ RUPY ===")

#" === ЗАПУСК ПРОГРАММЫ RUPY ==="
оператор = input("Представьтесь, создатель: ")
print("Приветствую, " + оператор + "!")

#"Приветствую, " + оператор + "!"
бот = Робот("Валли", "Уборщик")

#бот = Робот("Валли", "Уборщик")
бот.взять_вещь("Старая ложка")
бот.взять_вещь("Растение")
бот.взять_вещь("Болт")

#
print("Нужно выкинуть мусор...")
бот.инвентарь.remove("Болт")

#
print("Проверка моторов...")
for _ in range(3):
    print("Пип-буп!")

итераций = 2
for номер in range(итераций):
    print("Шаг теста № " + str(номер + 1))


print("--- ТЕСТ ЛОГИКИ ---")
доступ_разрешен = True
система_сломана = False

if доступ_разрешен and not система_сломана:
    print("Логика И and НЕ работает: Доступ в систему открыт!")

заряд_аккумулятора = 15
критический_режим = True

if заряд_аккумулятора < 20 or критический_режим:
    print("Логика ИЛИ работает: Робот переходит в энергосбережение!")


print("--- ТЕСТ СИСТЕМЫ ФАЙЛОВ ---")

#"--- ТЕСТ СИСТЕМЫ ФАЙЛОВ ---"
with open("лог_робота.txt","w", encoding="utf-8") as файл_логирования:
    файл_логирования.write("Запись №1: Робот успешно инициализирован.\n")
    файл_логирования.write("Запись №2: Обнаружен русский текст в файлах!\n")

print("Файл успешно записан!")

#"Файл успешно записан!"
with open("лог_робота.txt","r", encoding="utf-8") as читаемый_файл:
    лог_данные = читаемый_файл.read()
    print("Содержимое созданного файла:")
    print(лог_данные)



рез = расчет_мощности(10,5)
if рез > 40:
    print("Мощность в норме: " + str(рез))

try:
    print("Проверка деления на ноль...")
    ошибка = 10 / 0
except Exception as и:
    print("ОШИБКА: Система перехватила деление на ноль!")
    print(и)

бот.работа("Уборка мусора")
бот.статус()

print("=== ТЕСТ ЗАВЕРШЕН УСПЕШНО ===")